cases/00-tutorials/P2D-ser2/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (metal gas);

sigma           0.07;

dsigmadT	-0.5e-4;

p0		100000.0;
Tvap 3068.0;
Mm 5.58e-2;
LatentHeatVap 7.45e6;
// ************************************************************************* //
