cases/00-tutorials/P2D-ser2/constant/timeVsLaserPosition0
(
    (0    (0 0.005 0))
    (1    (0 0.005 0.6))
)