cases/00-tutorials/P2D-ser2/constant/timeVsLaserPower1
(
    (0           2000)
    (1           2000)
)